Q1. Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

In [6]:
import numpy as np
import pandas as pd
df = pd.read_csv('housingdata.csv')
print("The first six rows of the DataFrame are displayed below:-")
#df.head(6)
df

The first six rows of the DataFrame are displayed below:-

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

Q2. Display the column names and row index in separate cells.

In [50]:
print("The column names are:-")
df.columns

The column names are:-

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [67]:
print("The row indices are:-")
print(list(df.index))

The row indices are:-
RangeIndex(start=0, stop=9, step=1)

3a. How many numbers of “STATE” exist in the dataset.

In [79]:
print("The number of states in the dataset are:-")
df.shape[0]

The number of states in the dataset are:-

9

b. How many unique states exist in the dataset.

In [20]:
print("The number of unique states in the dataset are:-")df['STATE'].nunique()

The number of unique states in the dataset are:-

6

4. Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list.

In [108]:
df_var= df.replace('na', np.nan)
print(df_var.isna())

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True

5. Drop all rows with N/A,NA,na values in Num_Bedrooms.

In [142]:
#Replacing na with NaN
df['NUM_BEDROOMS'] = df['NUM_BEDROOMS'].replace('na', np.nan)

#Dropping the rows with NaN values in NUM_BEDROOMS column
df = df.dropna(subset=['NUM_BEDROOMS'])

#Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

6. Replace the NaN and String entries in Num_Bath with previous entry.

In [145]:
#Replacing non numeric entries with NaN
df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'], errors='coerce')

#Performing forward fill
df['NUM_BATH'] = df['NUM_BATH'].fillna(method='ffill')

#Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654            3       1.0  1000
1  100002000.0  MAHARASHTRA      21325            3       1.5    --
3  100004000.0           TN     321321            1       1.5   700
4          NaN           TN  589465645            3       2.0  1600
6  100007000.0        ASSAM    3222321            2       2.0   950
7  100008000.0           HP      23131            1       1.0   NaN

7. Replace the empty values in “SQ_FT” with the mean of the all entries.

In [7]:
#Replacing non numeric entries with NaN
df['SQ_FT'] = pd.to_numeric(df['SQ_FT'], errors='coerce')

#Filling null values with mean
df['SQ_FT'] = df['SQ_FT'].fillna(df['SQ_FT'].mean())

#Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1100.0
2  100003000.0           AP    2541654          NaN        1   850.0
3  100004000.0           TN     321321            1      NaN   700.0
4          NaN           TN  589465645            3        2  1600.0
5  100006000.0           TN   65465466          NaN        1   800.0
6  100007000.0        ASSAM    3222321            2   HURLEY   950.0
7  100008000.0           HP      23131            1        1  1100.0
8  100009000.0           HP      21212           na        2  1800.0

8. What is the sum of SQ_FT of all entries in the dataset.

In [9]:
print(f"The sum of the SQ_FT of all entries in the dataset is {df['SQ_FT'].sum()} sq-ft.")

The sum of the SQ_FT of all entries in the dataset is 9900.0 sq-ft.

9. Add a new column “NUM_STORE” and with all the values as 1 for all rows.

In [10]:
#Adding column NUM_STORE with values 1
df['NUM_STORE'] = 1

#Displaying the Dataframe
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
2,100003000.0,AP,2541654,NaN,1,850.0,1
3,100004000.0,TN,321321,1,NaN,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
5,100006000.0,TN,65465466,NaN,1,800.0,1
6,100007000.0,ASSAM,3222321,2,HURLEY,950.0,1
7,100008000.0,HP,23131,1,1,1100.0,1
8,100009000.0,HP,21212,na,2,1800.0,1

10. Create a DataFrame containing all entries of TN state only.

In [11]:
#Creating a mask
tn_mask = df['STATE'] == 'TN'

#Applying the mask to create a new Dataframe df_tn
df_tn = df[tn_mask]

#Displaying the Dataframe
df_tn

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1      NaN   700.0          1
4          NaN    TN  589465645            3        2  1600.0          1
5  100006000.0    TN   65465466          NaN        1   800.0          1

11. Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame.

In [12]:
#Creating a mask
sq_ft_mask = df['SQ_FT'] > 1000

#Applying the mask to create a new Dataframe df_sq_ft
df_sq_ft = df[sq_ft_mask]

#Displaying the Dataframe
df_sq_ft

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
4,NaN,TN,589465645,3,2,1600.0,1
7,100008000.0,HP,23131,1,1,1100.0,1
8,100009000.0,HP,21212,na,2,1800.0,1

12. Create a DataFrame having only first Three columns and First Three rows.

In [13]:
#Creating dataframe having only first three rows and three columns
df_3_3 = df.iloc[:3, :3]

#Displaying the Dataframe
df_3_3

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

13. Display the state having highest average price per square foot of housing area. Hint: Average of(TotalPrice/Sq_Ft).

In [15]:
# Calculating Total Price per Sq Ft
df['PRICE_PER_SQ_FT'] = df['PRICE']/df['SQ_FT']

#Finding Average of Price Per Sq-Ft grouped by STATE and sorting in descending order
state_avg_price_per_sq_ft = df.groupby('STATE')['PRICE_PER_SQ_FT'].mean().sort_values(ascending=False)

#Displaying the state having highest average price per square foot of housing area
print(f"The state having highest average price per square foot of housing area is {list(state_avg_price_per_sq_ft.index)[0]}")

The state having highest average price per square foot of housing area is TN